# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [4]:
# your code here
display(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [16]:
# your code here
for e in temp.columns:
    print(e, type(e))

City <class 'str'>
State <class 'str'>
Temperature <class 'str'>

In [6]:
"""
temperature is string, should be numeric float
"""

'\ntemperature is string, should be numeric float\n'

#### Select the rows where state is New York.

In [8]:
# your code here
temp.loc[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [19]:
# your code here
temp.loc[temp['State'] == 'New York','Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [31]:
# your code herem
temp.loc[temp['Temperature'].astype(int) < 15][['City','State']]

         City        State
1      Albany     New York
2     Buffalo     New York
4  Bridgeport  Connecticut

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [34]:
# your code here
temp.loc[temp['Temperature'].astype(int) > 15][['City']]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [38]:
# your code here
temp.loc[(temp['Temperature'].astype(int) > 15) & (temp['Temperature'].astype(int) < 20)][['City']]

       City
0       NYC
3  Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [43]:
# your code here
temp.groupby(by=['State'])[['Temperature']].agg(['mean', 'std'])

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [44]:
# your code here
employees = pd.read_csv('Employees.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [48]:
# your code here
display(employees)
print('Department' , employees['Department'].isna().sum())
print('Education' , employees['Education'].isna().sum())
print('Title' , employees['Title'].isna().sum())
print('Name' , employees['Name'].isna().sum())
print('Years' , employees['Years'].isna().sum())
print('Salary' , employees['Salary'].isna().sum())

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

Department 0
Education 0
Title 0
Name 0
Years 0
Salary 0

In [ ]:
"""
no missing values
"""

#### What's the average salary in this company?

In [49]:
# your code here
employees['Salary'].mean()

73.528

#### What's the highest salary?

In [50]:
# your code here
employees['Salary'].max()

120

#### What's the lowest salary?

In [51]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [54]:
# your code here
employees.sort_values('Salary', ascending=True)[:10]

    Department Education      Title      Name  Years  Salary
106      Admin  Bachelor  associate      Luke      4      30
214      Sales    Master         VP      Neil     11      30
27          IT  Bachelor    Analyst      Sean     12      30
128      Sales       PhD         VP      Adam      8      30
139      Sales       PhD    Analyst      Rick     11      30
266         HR       PhD  associate    Marcel     10      30
452         IT  Bachelor    Analyst  Augustin     13      30
333         IT    Master    Analyst    Edward      5      31
243         HR       PhD  associate      Chad      5      31
47       Admin  Bachelor         VP   Melissa      8      31

#### Find all the information about an employee called David.

In [55]:
# your code here
employees.loc[employees['Name'] == 'David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [56]:
# your code here
employees.loc[employees['Name'] == 'David']['Salary']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [57]:
# your code here
employees.loc[employees['Title'] == 'associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [58]:
# Method 1
# your code here
employees.loc[employees['Title'] == 'associate'].head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [59]:
# Method 2
# your code here
employees.loc[employees['Title'] == 'associate'][:3]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [60]:
# your code here
employees.loc[(employees['Title'] == 'associate') & (employees['Salary'] > 35)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[145 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [62]:
# your code here
employees.groupby(by=['Years'])[['Salary']].agg('mean')

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [68]:
# your code here

employees.groupby(by=['Title'])[['Salary']].agg('mean')

              Salary
Title
Analyst    73.703911
VP         72.907975
associate  73.968354

####  Find the salary quartiles.

In [67]:
# your code here
print('q25 ',np.quantile(employees['Salary'], .25))
print('q50 ',np.quantile(employees['Salary'], .50))
print('q75 ',np.quantile(employees['Salary'], .75))

q25  50.0
q50  72.0
q75  97.0

#### Is the mean salary different per gender?

In [79]:
# your code here

import gender_guesser.detector as gender
gd = gender.Detector()

employees['Gender'] = employees['Name'].apply(lambda x: gd.get_gender(x))

employees.groupby(by=['Gender'])['Salary'].agg('mean')

Gender
andy             66.600000
female           73.773913
male             72.927900
mostly_female    78.043478
mostly_male      76.214286
unknown          75.400000
Name: Salary, dtype: float64

In [95]:
# your code here

import gender_guesser.detector as gender
gd = gender.Detector()


display(employees.groupby(by=['Gender'])[['Name']])

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [ ]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here